In [1]:
filepath = "/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/executable/spider_eval/eval_txts/meta-llama/Meta-Llama-3-8B-Instruct_pred_200.txt"

with open(filepath, 'r') as file:
    lines = file.readlines()

In [13]:
import re

def clean_pred_txt(prediction_txt_file):

    with open(prediction_txt_file, 'r') as file:
        lines = file.readlines()

    single_string = ' '.join(lines)
    cleaned_string = single_string.replace('\n', '')


    pattern = r'\t(?=\d)'
    split_result = re.split(pattern, cleaned_string)

    new_list = []

    for x in split_result:
        no_digits = re.sub(r'\d', '', x)
        new_list.append(no_digits)

    # Open the output file in write mode
    with open(prediction_txt_file, 'w') as file:
        # Iterate over each line in the list
        for line in new_list:
            # Write the line to the file
            file.write(line + '\n')

### llama3 cleaning

In [26]:
clean_pred_txt("/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/executable/spider_eval/eval_txts/meta-llama/Meta-Llama-3-8B-Instruct_pred_200.txt")

### Mistral cleaning

In [27]:
clean_pred_txt("/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/executable/spider_eval/eval_txts/mistralai/Mistral-7B-Instruct-v0.1_pred_200.txt")

### GOLD

In [21]:
def process_file(filename):
    # Read all lines from the file
    with open(filename, 'r') as file:
        lines = file.readlines()
    print(lines)
    # Process each line
    pattern = r'\t\d+'

    # Iterate through the list and replace matching patterns with empty string
    new_list = [re.sub(pattern, '', entry) for entry in lines]
        
    print(new_list)



        # Write the processed lines back to the same file
    with open(filename, 'w') as file:
        for processed_line in new_list:
            file.write(processed_line)

# Example usage:


# Example usage:
filename = "/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/executable/spider_eval/eval_txts/meta-llama/Meta-Llama-3-8B-Instruct_gold_200.txt"  # Replace "your_file.txt" with the path to your text file
process_file(filename)
print("File processed and updated successfully!")

['SELECT Title FROM Cartoon ORDER BY title\ttvshow\t0\n', 'SELECT Title FROM Cartoon ORDER BY title\ttvshow\t1\n', 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";\ttvshow\t2\n', 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";\ttvshow\t3\n', 'SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";\ttvshow\t4\n', 'SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";\ttvshow\t5\n', 'SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date\ttvshow\t6\n', 'SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date\ttvshow\t7\n', 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";\ttvshow\t8\n', 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";\ttvshow\t9\n', 'SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;\ttvshow\t10\n', 'SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;\ttvshow\t11\n', 'SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;\ttvshow\t12\n', 'SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;\ttvshow\t13\n', 'SELECT Content FROM TV_Channel WHERE series_name = "Sky Radio";\ttvshow\t14\n', 'SELECT Content FROM TV_Channel WHERE series_name = "Sky Radio";\ttvshow\t15\n', 'SELECT Package_Option FROM TV_Channel WHERE series_name = "Sky Radio";\ttvshow\t16\n', 'SELECT Package_Option FROM TV_Channel WHERE series_name = "Sky Radio";\ttvshow\t17\n', 'SELECT count(*) FROM TV_Channel WHERE LANGUAGE = "English";\ttvshow\t18\n', 'SELECT count(*) FROM TV_Channel WHERE LANGUAGE = "English";\ttvshow\t19\n', 'SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE ORDER BY count(*) ASC LIMIT 1;\ttvshow\t20\n', 'SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE ORDER BY count(*) ASC LIMIT 1;\ttvshow\t21\n', 'SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE\ttvshow\t22\n', 'SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE\ttvshow\t23\n', 'SELECT T1.series_name FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T2.Title = "The Rise of the Blue Beetle!";\ttvshow\t24\n', 'SELECT T1.series_name FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T2.Title = "The Rise of the Blue Beetle!";\ttvshow\t25\n', 'SELECT T2.Title FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";\ttvshow\t26\n', 'SELECT T2.Title FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";\ttvshow\t27\n', 'SELECT Episode FROM TV_series ORDER BY rating\ttvshow\t28\n', 'SELECT Episode FROM TV_series ORDER BY rating\ttvshow\t29\n', 'SELECT Episode ,  Rating FROM TV_series ORDER BY Rating DESC LIMIT 3;\ttvshow\t30\n', 'SELECT Episode ,  Rating FROM TV_series ORDER BY Rating DESC LIMIT 3;\ttvshow\t31\n', 'SELECT max(SHARE) , min(SHARE) FROM TV_series;\ttvshow\t32\n', 'SELECT max(SHARE) , min(SHARE) FROM TV_series;\ttvshow\t33\n', 'SELECT Air_Date FROM TV_series WHERE Episode = "A Love of a Lifetime";\ttvshow\t34\n', 'SELECT Air_Date FROM TV_series WHERE Episode = "A Love of a Lifetime";\ttvshow\t35\n', 'SELECT Weekly_Rank FROM TV_series WHERE Episode = "A Love of a Lifetime";\ttvshow\t36\n', 'SELECT Weekly_Rank FROM TV_series WHERE Episode = "A Love of a Lifetime";\ttvshow\t37\n', 'SELECT T1.series_name FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T2.Episode = "A Love of a Lifetime";\ttvshow\t38\n', 'SELECT T1.series_name FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T2.Episode = "A Love of a Lifetime";\ttvshow\t39\n', 'SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";\ttvshow\t40\n', 'SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";\ttvshow\t41\n', 'SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by\ttvshow\t42\n', 'SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by\ttvshow\t43\n', 'select production_code ,  channel from cartoon order by original_air_date desc limit 1\ttvshow\t44\n', 'select production_code ,  channel from cartoon order by original_air_date desc limit 1\ttvshow\t45\n', 'SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"\ttvshow\t46\n', 'SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"\ttvshow\t47\n', "SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'\ttvshow\t48\n", "SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'\ttvshow\t49\n", "SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'\ttvshow\t50\n", "SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'\ttvshow\t51\n", "SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'\ttvshow\t52\n", "SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'\ttvshow\t53\n", "SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'\ttvshow\t54\n", "SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'\ttvshow\t55\n", 'SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2\ttvshow\t56\n', 'SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2\ttvshow\t57\n', "SELECT id FROM TV_Channel EXCEPT SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones'\ttvshow\t58\n", "SELECT id FROM TV_Channel EXCEPT SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones'\ttvshow\t59\n", "SELECT package_option FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones')\ttvshow\t60\n", "SELECT package_option FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones')\ttvshow\t61\n", 'SELECT count(*) FROM pets WHERE weight  >  10\tpets_1\t62\n', 'SELECT count(*) FROM pets WHERE weight  >  10\tpets_1\t63\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\tpets_1\t64\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\tpets_1\t65\n', 'SELECT max(weight) ,  petType FROM pets GROUP BY petType\tpets_1\t66\n', 'SELECT max(weight) ,  petType FROM pets GROUP BY petType\tpets_1\t67\n', 'SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20\tpets_1\t68\n', 'SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20\tpets_1\t69\n', "SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'\tpets_1\t70\n", "SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'\tpets_1\t71\n", 'SELECT count(DISTINCT pettype) FROM pets\tpets_1\t72\n', 'SELECT count(DISTINCT pettype) FROM pets\tpets_1\t73\n', "SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'\tpets_1\t74\n", "SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'\tpets_1\t75\n", "select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'\tpets_1\t76\n", "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'\tpets_1\t77\n", "SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\tpets_1\t78\n", "SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\tpets_1\t79\n", "SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'\tpets_1\t80\n", "SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'\tpets_1\t81\n", "SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\tpets_1\t82\n", "SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\tpets_1\t83\n", 'SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1\tpets_1\t84\n', 'SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1\tpets_1\t85\n', 'SELECT petid ,  weight FROM pets WHERE pet_age  >  1\tpets_1\t86\n', 'SELECT petid ,  weight FROM pets WHERE pet_age  >  1\tpets_1\t87\n', 'SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype\tpets_1\t88\n', 'SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype\tpets_1\t89\n', 'SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype\tpets_1\t90\n', 'SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype\tpets_1\t91\n', 'SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid\tpets_1\t92\n', 'SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid\tpets_1\t93\n', "SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'\tpets_1\t94\n", "SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'\tpets_1\t95\n", 'SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid\tpets_1\t96\n', 'select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid\tpets_1\t97\n', 'SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1\tpets_1\t98\n', 'SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1\tpets_1\t99\n', "SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'\tpets_1\t100\n", "SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'\tpets_1\t101\n", 'select avg(age) from student where stuid not in (select stuid from has_pet)\tpets_1\t102\n', 'select avg(age) from student where stuid not in (select stuid from has_pet)\tpets_1\t103\n', 'SELECT count(*) FROM teacher\tcourse_teach\t104\n', 'SELECT count(*) FROM teacher\tcourse_teach\t105\n', 'SELECT Name FROM teacher ORDER BY Age ASC\tcourse_teach\t106\n', 'SELECT Name FROM teacher ORDER BY Age ASC\tcourse_teach\t107\n', 'SELECT Age ,  Hometown FROM teacher\tcourse_teach\t108\n', 'SELECT Age ,  Hometown FROM teacher\tcourse_teach\t109\n', 'select name from teacher where hometown != "little lever urban district"\tcourse_teach\t110\n', 'select name from teacher where hometown != "little lever urban district"\tcourse_teach\t111\n', 'SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33\tcourse_teach\t112\n', 'SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33\tcourse_teach\t113\n', 'SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1\tcourse_teach\t114\n', 'SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1\tcourse_teach\t115\n', 'SELECT Hometown ,  COUNT(*) FROM teacher GROUP BY Hometown\tcourse_teach\t116\n', 'SELECT Hometown ,  COUNT(*) FROM teacher GROUP BY Hometown\tcourse_teach\t117\n', 'SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1\tcourse_teach\t118\n', 'SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1\tcourse_teach\t119\n', 'SELECT Hometown FROM teacher GROUP BY Hometown HAVING COUNT(*)  >=  2\tcourse_teach\t120\n', 'SELECT Hometown FROM teacher GROUP BY Hometown HAVING COUNT(*)  >=  2\tcourse_teach\t121\n', 'SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID\tcourse_teach\t122\n', 'SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID\tcourse_teach\t123\n', 'SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name\tcourse_teach\t124\n', 'SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name\tcourse_teach\t125\n', 'SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"\tcourse_teach\t126\n', 'SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"\tcourse_teach\t127\n', 'SELECT T2.Name ,  COUNT(*) FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name\tcourse_teach\t128\n', 'SELECT T2.Name ,  COUNT(*) FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name\tcourse_teach\t129\n', 'SELECT T2.Name FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name HAVING COUNT(*)  >=  2\tcourse_teach\t130\n', 'SELECT T2.Name FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name HAVING COUNT(*)  >=  2\tcourse_teach\t131\n', 'SELECT Name FROM teacher WHERE Teacher_id NOT IN (SELECT Teacher_id FROM course_arrange)\tcourse_teach\t132\n', 'SELECT Name FROM teacher WHERE Teacher_id NOT IN (SELECT Teacher_id FROM course_arrange)\tcourse_teach\t133\n', 'SELECT count(*) FROM Documents\tcre_Doc_Template_Mgt\t134\n', 'SELECT count(*) FROM Documents\tcre_Doc_Template_Mgt\t135\n', 'SELECT document_id ,  document_name ,  document_description FROM Documents\tcre_Doc_Template_Mgt\t136\n', 'SELECT document_id ,  document_name ,  document_description FROM Documents\tcre_Doc_Template_Mgt\t137\n', 'SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"\tcre_Doc_Template_Mgt\t138\n', 'SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"\tcre_Doc_Template_Mgt\t139\n', 'SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"\tcre_Doc_Template_Mgt\t140\n', 'SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"\tcre_Doc_Template_Mgt\t141\n', 'SELECT count(DISTINCT template_id) FROM Documents\tcre_Doc_Template_Mgt\t142\n', 'SELECT count(DISTINCT template_id) FROM Documents\tcre_Doc_Template_Mgt\t143\n', "SELECT count(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID  =  T2.Template_ID WHERE T2.Template_Type_Code  =  'PPT'\tcre_Doc_Template_Mgt\t144\n", "SELECT count(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID  =  T2.Template_ID WHERE T2.Template_Type_Code  =  'PPT'\tcre_Doc_Template_Mgt\t145\n", 'SELECT template_id ,  count(*) FROM Documents GROUP BY template_id\tcre_Doc_Template_Mgt\t146\n', 'SELECT template_id ,  count(*) FROM Documents GROUP BY template_id\tcre_Doc_Template_Mgt\t147\n', 'SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1\tcre_Doc_Template_Mgt\t148\n', 'SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1\tcre_Doc_Template_Mgt\t149\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1\tcre_Doc_Template_Mgt\t150\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1\tcre_Doc_Template_Mgt\t151\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\tcre_Doc_Template_Mgt\t152\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\tcre_Doc_Template_Mgt\t153\n', 'SELECT count(*) FROM Templates\tcre_Doc_Template_Mgt\t154\n', 'SELECT count(*) FROM Templates\tcre_Doc_Template_Mgt\t155\n', 'SELECT template_id ,  version_number ,  template_type_code FROM Templates\tcre_Doc_Template_Mgt\t156\n', 'SELECT template_id ,  version_number ,  template_type_code FROM Templates\tcre_Doc_Template_Mgt\t157\n', 'SELECT DISTINCT template_type_code FROM Templates\tcre_Doc_Template_Mgt\t158\n', 'SELECT DISTINCT template_type_code FROM Templates\tcre_Doc_Template_Mgt\t159\n', 'SELECT template_id FROM Templates WHERE template_type_code  =  "PP" OR template_type_code  =  "PPT"\tcre_Doc_Template_Mgt\t160\n', 'SELECT template_id FROM Templates WHERE template_type_code  =  "PP" OR template_type_code  =  "PPT"\tcre_Doc_Template_Mgt\t161\n', 'SELECT count(*) FROM Templates WHERE template_type_code  =  "CV"\tcre_Doc_Template_Mgt\t162\n', 'SELECT count(*) FROM Templates WHERE template_type_code  =  "CV"\tcre_Doc_Template_Mgt\t163\n', 'SELECT version_number ,  template_type_code FROM Templates WHERE version_number  >  5\tcre_Doc_Template_Mgt\t164\n', 'SELECT version_number ,  template_type_code FROM Templates WHERE version_number  >  5\tcre_Doc_Template_Mgt\t165\n', 'SELECT template_type_code ,  count(*) FROM Templates GROUP BY template_type_code\tcre_Doc_Template_Mgt\t166\n', 'SELECT template_type_code ,  count(*) FROM Templates GROUP BY template_type_code\tcre_Doc_Template_Mgt\t167\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1\tcre_Doc_Template_Mgt\t168\n', 'SELECT template_type_code FROM Templates GROUP BY temp

In [22]:
filename = "/Users/mymac/LLM/Personal-Medical-Assistant/backend/evaluation/executable/spider_eval/eval_txts/mistralai/Mistral-7B-Instruct-v0.1_gold_200.txt"

process_file(filename)
print("File processed and updated successfully!")

['SELECT Title FROM Cartoon ORDER BY title\ttvshow\t0\n', 'SELECT Title FROM Cartoon ORDER BY title\ttvshow\t1\n', 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";\ttvshow\t2\n', 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";\ttvshow\t3\n', 'SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";\ttvshow\t4\n', 'SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";\ttvshow\t5\n', 'SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date\ttvshow\t6\n', 'SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date\ttvshow\t7\n', 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";\ttvshow\t8\n', 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";\ttvshow\t9\n', 'SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;\ttvshow\t10\n', 'SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;\ttvshow\t11\n', 'SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;\ttvshow\t12\n', 'SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;\ttvshow\t13\n', 'SELECT Content FROM TV_Channel WHERE series_name = "Sky Radio";\ttvshow\t14\n', 'SELECT Content FROM TV_Channel WHERE series_name = "Sky Radio";\ttvshow\t15\n', 'SELECT Package_Option FROM TV_Channel WHERE series_name = "Sky Radio";\ttvshow\t16\n', 'SELECT Package_Option FROM TV_Channel WHERE series_name = "Sky Radio";\ttvshow\t17\n', 'SELECT count(*) FROM TV_Channel WHERE LANGUAGE = "English";\ttvshow\t18\n', 'SELECT count(*) FROM TV_Channel WHERE LANGUAGE = "English";\ttvshow\t19\n', 'SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE ORDER BY count(*) ASC LIMIT 1;\ttvshow\t20\n', 'SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE ORDER BY count(*) ASC LIMIT 1;\ttvshow\t21\n', 'SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE\ttvshow\t22\n', 'SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE\ttvshow\t23\n', 'SELECT T1.series_name FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T2.Title = "The Rise of the Blue Beetle!";\ttvshow\t24\n', 'SELECT T1.series_name FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T2.Title = "The Rise of the Blue Beetle!";\ttvshow\t25\n', 'SELECT T2.Title FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";\ttvshow\t26\n', 'SELECT T2.Title FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";\ttvshow\t27\n', 'SELECT Episode FROM TV_series ORDER BY rating\ttvshow\t28\n', 'SELECT Episode FROM TV_series ORDER BY rating\ttvshow\t29\n', 'SELECT Episode ,  Rating FROM TV_series ORDER BY Rating DESC LIMIT 3;\ttvshow\t30\n', 'SELECT Episode ,  Rating FROM TV_series ORDER BY Rating DESC LIMIT 3;\ttvshow\t31\n', 'SELECT max(SHARE) , min(SHARE) FROM TV_series;\ttvshow\t32\n', 'SELECT max(SHARE) , min(SHARE) FROM TV_series;\ttvshow\t33\n', 'SELECT Air_Date FROM TV_series WHERE Episode = "A Love of a Lifetime";\ttvshow\t34\n', 'SELECT Air_Date FROM TV_series WHERE Episode = "A Love of a Lifetime";\ttvshow\t35\n', 'SELECT Weekly_Rank FROM TV_series WHERE Episode = "A Love of a Lifetime";\ttvshow\t36\n', 'SELECT Weekly_Rank FROM TV_series WHERE Episode = "A Love of a Lifetime";\ttvshow\t37\n', 'SELECT T1.series_name FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T2.Episode = "A Love of a Lifetime";\ttvshow\t38\n', 'SELECT T1.series_name FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T2.Episode = "A Love of a Lifetime";\ttvshow\t39\n', 'SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";\ttvshow\t40\n', 'SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";\ttvshow\t41\n', 'SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by\ttvshow\t42\n', 'SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by\ttvshow\t43\n', 'select production_code ,  channel from cartoon order by original_air_date desc limit 1\ttvshow\t44\n', 'select production_code ,  channel from cartoon order by original_air_date desc limit 1\ttvshow\t45\n', 'SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"\ttvshow\t46\n', 'SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"\ttvshow\t47\n', "SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'\ttvshow\t48\n", "SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'\ttvshow\t49\n", "SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'\ttvshow\t50\n", "SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'\ttvshow\t51\n", "SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'\ttvshow\t52\n", "SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'\ttvshow\t53\n", "SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'\ttvshow\t54\n", "SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'\ttvshow\t55\n", 'SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2\ttvshow\t56\n', 'SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2\ttvshow\t57\n', "SELECT id FROM TV_Channel EXCEPT SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones'\ttvshow\t58\n", "SELECT id FROM TV_Channel EXCEPT SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones'\ttvshow\t59\n", "SELECT package_option FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones')\ttvshow\t60\n", "SELECT package_option FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones')\ttvshow\t61\n", 'SELECT count(*) FROM pets WHERE weight  >  10\tpets_1\t62\n', 'SELECT count(*) FROM pets WHERE weight  >  10\tpets_1\t63\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\tpets_1\t64\n', 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1\tpets_1\t65\n', 'SELECT max(weight) ,  petType FROM pets GROUP BY petType\tpets_1\t66\n', 'SELECT max(weight) ,  petType FROM pets GROUP BY petType\tpets_1\t67\n', 'SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20\tpets_1\t68\n', 'SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20\tpets_1\t69\n', "SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'\tpets_1\t70\n", "SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'\tpets_1\t71\n", 'SELECT count(DISTINCT pettype) FROM pets\tpets_1\t72\n', 'SELECT count(DISTINCT pettype) FROM pets\tpets_1\t73\n', "SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'\tpets_1\t74\n", "SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'\tpets_1\t75\n", "select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'\tpets_1\t76\n", "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'\tpets_1\t77\n", "SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\tpets_1\t78\n", "SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\tpets_1\t79\n", "SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'\tpets_1\t80\n", "SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'\tpets_1\t81\n", "SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\tpets_1\t82\n", "SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')\tpets_1\t83\n", 'SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1\tpets_1\t84\n', 'SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1\tpets_1\t85\n', 'SELECT petid ,  weight FROM pets WHERE pet_age  >  1\tpets_1\t86\n', 'SELECT petid ,  weight FROM pets WHERE pet_age  >  1\tpets_1\t87\n', 'SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype\tpets_1\t88\n', 'SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype\tpets_1\t89\n', 'SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype\tpets_1\t90\n', 'SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype\tpets_1\t91\n', 'SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid\tpets_1\t92\n', 'SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid\tpets_1\t93\n', "SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'\tpets_1\t94\n", "SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'\tpets_1\t95\n", 'SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid\tpets_1\t96\n', 'select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid\tpets_1\t97\n', 'SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1\tpets_1\t98\n', 'SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1\tpets_1\t99\n', "SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'\tpets_1\t100\n", "SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'\tpets_1\t101\n", 'select avg(age) from student where stuid not in (select stuid from has_pet)\tpets_1\t102\n', 'select avg(age) from student where stuid not in (select stuid from has_pet)\tpets_1\t103\n', 'SELECT count(*) FROM teacher\tcourse_teach\t104\n', 'SELECT count(*) FROM teacher\tcourse_teach\t105\n', 'SELECT Name FROM teacher ORDER BY Age ASC\tcourse_teach\t106\n', 'SELECT Name FROM teacher ORDER BY Age ASC\tcourse_teach\t107\n', 'SELECT Age ,  Hometown FROM teacher\tcourse_teach\t108\n', 'SELECT Age ,  Hometown FROM teacher\tcourse_teach\t109\n', 'select name from teacher where hometown != "little lever urban district"\tcourse_teach\t110\n', 'select name from teacher where hometown != "little lever urban district"\tcourse_teach\t111\n', 'SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33\tcourse_teach\t112\n', 'SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33\tcourse_teach\t113\n', 'SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1\tcourse_teach\t114\n', 'SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1\tcourse_teach\t115\n', 'SELECT Hometown ,  COUNT(*) FROM teacher GROUP BY Hometown\tcourse_teach\t116\n', 'SELECT Hometown ,  COUNT(*) FROM teacher GROUP BY Hometown\tcourse_teach\t117\n', 'SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1\tcourse_teach\t118\n', 'SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1\tcourse_teach\t119\n', 'SELECT Hometown FROM teacher GROUP BY Hometown HAVING COUNT(*)  >=  2\tcourse_teach\t120\n', 'SELECT Hometown FROM teacher GROUP BY Hometown HAVING COUNT(*)  >=  2\tcourse_teach\t121\n', 'SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID\tcourse_teach\t122\n', 'SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID\tcourse_teach\t123\n', 'SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name\tcourse_teach\t124\n', 'SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name\tcourse_teach\t125\n', 'SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"\tcourse_teach\t126\n', 'SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"\tcourse_teach\t127\n', 'SELECT T2.Name ,  COUNT(*) FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name\tcourse_teach\t128\n', 'SELECT T2.Name ,  COUNT(*) FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name\tcourse_teach\t129\n', 'SELECT T2.Name FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name HAVING COUNT(*)  >=  2\tcourse_teach\t130\n', 'SELECT T2.Name FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name HAVING COUNT(*)  >=  2\tcourse_teach\t131\n', 'SELECT Name FROM teacher WHERE Teacher_id NOT IN (SELECT Teacher_id FROM course_arrange)\tcourse_teach\t132\n', 'SELECT Name FROM teacher WHERE Teacher_id NOT IN (SELECT Teacher_id FROM course_arrange)\tcourse_teach\t133\n', 'SELECT count(*) FROM Documents\tcre_Doc_Template_Mgt\t134\n', 'SELECT count(*) FROM Documents\tcre_Doc_Template_Mgt\t135\n', 'SELECT document_id ,  document_name ,  document_description FROM Documents\tcre_Doc_Template_Mgt\t136\n', 'SELECT document_id ,  document_name ,  document_description FROM Documents\tcre_Doc_Template_Mgt\t137\n', 'SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"\tcre_Doc_Template_Mgt\t138\n', 'SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"\tcre_Doc_Template_Mgt\t139\n', 'SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"\tcre_Doc_Template_Mgt\t140\n', 'SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"\tcre_Doc_Template_Mgt\t141\n', 'SELECT count(DISTINCT template_id) FROM Documents\tcre_Doc_Template_Mgt\t142\n', 'SELECT count(DISTINCT template_id) FROM Documents\tcre_Doc_Template_Mgt\t143\n', "SELECT count(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID  =  T2.Template_ID WHERE T2.Template_Type_Code  =  'PPT'\tcre_Doc_Template_Mgt\t144\n", "SELECT count(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID  =  T2.Template_ID WHERE T2.Template_Type_Code  =  'PPT'\tcre_Doc_Template_Mgt\t145\n", 'SELECT template_id ,  count(*) FROM Documents GROUP BY template_id\tcre_Doc_Template_Mgt\t146\n', 'SELECT template_id ,  count(*) FROM Documents GROUP BY template_id\tcre_Doc_Template_Mgt\t147\n', 'SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1\tcre_Doc_Template_Mgt\t148\n', 'SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1\tcre_Doc_Template_Mgt\t149\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1\tcre_Doc_Template_Mgt\t150\n', 'SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1\tcre_Doc_Template_Mgt\t151\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\tcre_Doc_Template_Mgt\t152\n', 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents\tcre_Doc_Template_Mgt\t153\n', 'SELECT count(*) FROM Templates\tcre_Doc_Template_Mgt\t154\n', 'SELECT count(*) FROM Templates\tcre_Doc_Template_Mgt\t155\n', 'SELECT template_id ,  version_number ,  template_type_code FROM Templates\tcre_Doc_Template_Mgt\t156\n', 'SELECT template_id ,  version_number ,  template_type_code FROM Templates\tcre_Doc_Template_Mgt\t157\n', 'SELECT DISTINCT template_type_code FROM Templates\tcre_Doc_Template_Mgt\t158\n', 'SELECT DISTINCT template_type_code FROM Templates\tcre_Doc_Template_Mgt\t159\n', 'SELECT template_id FROM Templates WHERE template_type_code  =  "PP" OR template_type_code  =  "PPT"\tcre_Doc_Template_Mgt\t160\n', 'SELECT template_id FROM Templates WHERE template_type_code  =  "PP" OR template_type_code  =  "PPT"\tcre_Doc_Template_Mgt\t161\n', 'SELECT count(*) FROM Templates WHERE template_type_code  =  "CV"\tcre_Doc_Template_Mgt\t162\n', 'SELECT count(*) FROM Templates WHERE template_type_code  =  "CV"\tcre_Doc_Template_Mgt\t163\n', 'SELECT version_number ,  template_type_code FROM Templates WHERE version_number  >  5\tcre_Doc_Template_Mgt\t164\n', 'SELECT version_number ,  template_type_code FROM Templates WHERE version_number  >  5\tcre_Doc_Template_Mgt\t165\n', 'SELECT template_type_code ,  count(*) FROM Templates GROUP BY template_type_code\tcre_Doc_Template_Mgt\t166\n', 'SELECT template_type_code ,  count(*) FROM Templates GROUP BY template_type_code\tcre_Doc_Template_Mgt\t167\n', 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1\tcre_Doc_Template_Mgt\t168\n', 'SELECT template_type_code FROM Templates GROUP BY temp